SaitovSP/src/Documents/НазаначениеОклада/НазаначениеОклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазаначениеОклада</name>
  <registerRecords>InformationRegister.РазряднаяСетка</registerRecords>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначениеОклада</name>
    <attributes>
      <name>Разряд</name>
      <type>
        <types>CatalogRef.Разряды</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/InformationRegisters/РазряднаяСетка/РазряднаяСетка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазряднаяСетка</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.Разряды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/Documents/НазаначениеОклада/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр РазряднаяСетка
	Движения.РазряднаяСетка.Записывать = Истина;
	Для Каждого ТекСтрокаНазначениеОклада Из НазначениеОклада Цикл
		Движение = Движения.РазряднаяСетка.Добавить();
		Движение.Период = Дата;
		Движение.Разряд = ТекСтрокаНазначениеОклада.Разряд;
		Движение.Ресторан = Ресторан;
		Движение.Оклад = ТекСтрокаНазначениеОклада.Оклад;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти
